<?php

namespace Shiren\Yao;

class Definition
{
    /**
     * 先天八卦
     */
    const Gong = ['乾', '坎', '艮', '震', '巽', '离', '坤', '兑'];

    /**
     * 卦象
     */
    const Xiang = ['八纯卦', '初爻卦', '二爻变', '三爻变', '四爻变', '五爻变', '游魂卦', '归魂卦'];

    /**
     * 六十四卦分宫卦象次序
     */
    const CS = [
     // 索引    卦名     行，列(分宫、卦象)
        1  => ['地雷复', 6, 1],
        2  => ['地水师', 1, 7],
        3  => ['地泽临', 6, 2],
        4  => ['地山谦', 7, 5],
        5  => ['地火明夷', 1, 6],
        6  => ['地风升', 3, 4],
        7  => ['地天泰', 6, 3],
        8  => ['雷地豫', 3, 1],
        9  => ['震为雷', 3, 0],
        10 => ['雷水解', 3, 2],
        11 => ['雷泽归妹', 7, 7],
        12 => ['雷山小过', 7, 6],
        13 => ['雷火丰', 1, 5],
        14 => ['雷风恒', 3, 3],
        15 => ['雷天大壮', 6, 4],
        16 => ['水地比', 6, 7],
        17 => ['水雷屯', 1, 2],
        18 => ['坎为水', 1, 0],
        19 => ['水泽节', 1, 1],
        20 => ['水山蹇', 7, 4],
        21 => ['水火既济', 1, 3],
        22 => ['水风井', 3, 5],
        23 => ['水天需', 6, 6],
        24 => ['泽地萃', 7, 2],
        25 => ['泽雷随', 3, 7],
        26 => ['泽水困', 7, 1],
        27 => ['兑为泽', 7, 0],
        28 => ['泽山咸', 7, 3],
        29 => ['泽火革', 1, 4],
        30 => ['泽风大过', 3, 6],
        31 => ['泽天夬', 6, 5],
        32 => ['山地剥', 0, 5],
        33 => ['山雷颐', 4, 6],
        34 => ['山水蒙', 5, 4],
        35 => ['山泽损', 2, 3],
        36 => ['艮为山', 2, 0],
        37 => ['山火贲', 2, 1],
        38 => ['山风蛊', 4, 7],
        39 => ['山天大畜', 2, 2],
        40 => ['火地晋', 0, 6],
        41 => ['火雷噬嗑', 4, 5],
        42 => ['火水未济', 5, 3],
        43 => ['火泽睽', 2, 4],
        44 => ['火山旅', 5, 1],
        45 => ['离为火', 5, 0],
        46 => ['火风鼎', 5, 2],
        47 => ['火天大有', 0, 7],
        48 => ['风地观', 0, 4],
        49 => ['风雷益', 4, 3],
        50 => ['风水涣', 5, 5],
        51 => ['风泽中孚', 2, 6],
        52 => ['风山渐', 2, 7],
        53 => ['风火家人', 4, 2],
        54 => ['巽为风', 4, 0],
        55 => ['风天小畜', 4, 1],
        56 => ['天地否', 0, 3],
        57 => ['天雷无妄', 4, 4],
        58 => ['天水讼', 5, 6],
        59 => ['天泽履', 2, 5],
        60 => ['天山遁', 0, 2],
        61 => ['天火同人', 5, 7],
        62 => ['天风姤', 0, 1],
        63 => ['乾为天', 0, 0],
        0  => ['坤为地',  6, 0],
    ];

    /**
     * 先天八卦对应的五行索引
     */
    const Gong2Element = [4, 0, 3, 1, 1, 2, 3, 4];

    /**
     * 宫中第一卦
     */
    const GongFirstGua = [63, 18, 36, 9, 54, 45, 0, 27];

    /**
     * 象中的世爻位置(应爻位置在[世爻位置 + 3] % 6)
     */
    const Xiang4Yao = [5, 0, 1, 2, 3, 4, 3, 2];


    /**
     * 旬空算法
     * @param int $dayGan 日干
     * @param int $dayZhi 日支
     * @return int[] 两个旬空地支
     */
    public function XunKong(int $dayGan, int $dayZhi): array
    {
        $s = 9 - $dayGan + $dayZhi;
        return [($s + 1) % 12, ($s + 2) % 12];
    }
}